In [1]:
import numpy as np

In [4]:
array=np.random.normal(-10,10, size=[4, 4])
array

array([[-25.40313825, -24.19717567,  -9.15781626, -14.2737396 ],
       [-19.52647407,   1.40485958, -26.05607509, -14.9604029 ],
       [  5.52446883, -22.32461255, -10.77366076,  -0.03954453],
       [-16.95678401, -12.13347592,  -6.64274291,   9.44551199]])

In [5]:
import pandas as pd

In [6]:
pd.DataFrame([[2,3], [4,5]], index=['a', 'b'], columns=['w', 'x'])

   w  x
a  2  3
b  4  5

In [8]:
len(array)

4

In [7]:
pd.DataFrame(array)

           0          1          2          3
0 -25.403138 -24.197176  -9.157816 -14.273740
1 -19.526474   1.404860 -26.056075 -14.960403
2   5.524469 -22.324613 -10.773661  -0.039545
3 -16.956784 -12.133476  -6.642743   9.445512

In [15]:
df= pd.DataFrame(array, index=range(1, len(array)+1), columns=['w', 'x', 'y', 'z'])
df
#Para que empiece en el Ã­ndice 1

           w          x          y          z
1 -25.403138 -24.197176  -9.157816 -14.273740
2 -19.526474   1.404860 -26.056075 -14.960403
3   5.524469 -22.324613 -10.773661  -0.039545
4 -16.956784 -12.133476  -6.642743   9.445512

In [23]:
df['x'][2]
#Slicing, prmero columna, luego fila

np.float64(1.4048595772344434)

In [24]:
df.x

1   -24.197176
2     1.404860
3   -22.324613
4   -12.133476
Name: x, dtype: float64

In [27]:
columnas= ['w', 'y']
df[columnas]

           w          y
1 -25.403138  -9.157816
2 -19.526474 -26.056075
3   5.524469 -10.773661
4 -16.956784  -6.642743

In [28]:
df.x + df.y

1   -33.354992
2   -24.651216
3   -33.098273
4   -18.776219
dtype: float64

In [29]:
df['suma_x_z']=df.x + df.z
df

           w          x          y          z   suma_x_z
1 -25.403138 -24.197176  -9.157816 -14.273740 -38.470915
2 -19.526474   1.404860 -26.056075 -14.960403 -13.555543
3   5.524469 -22.324613 -10.773661  -0.039545 -22.364157
4 -16.956784 -12.133476  -6.642743   9.445512  -2.687964

In [31]:
df.drop('y', axis=1)
#Axis=1 es para borrar columnas
#Axis =0 es para borrar filas

           w          x          z   suma_x_z
1 -25.403138 -24.197176 -14.273740 -38.470915
2 -19.526474   1.404860 -14.960403 -13.555543
3   5.524469 -22.324613  -0.039545 -22.364157
4 -16.956784 -12.133476   9.445512  -2.687964

In [32]:
df.loc[3]

w            5.524469
x          -22.324613
y          -10.773661
z           -0.039545
suma_x_z   -22.364157
Name: 3, dtype: float64

In [33]:
df.iloc[0]

w          -25.403138
x          -24.197176
y           -9.157816
z          -14.273740
suma_x_z   -38.470915
Name: 1, dtype: float64

In [35]:
df.iloc[ [ 0, 2]]

           w          x          y          z   suma_x_z
1 -25.403138 -24.197176  -9.157816 -14.273740 -38.470915
3   5.524469 -22.324613 -10.773661  -0.039545 -22.364157

In [36]:
df.loc[3, 'x'] #Fila columna

np.float64(-22.324612553692287)

In [38]:
df.loc[ [2,4], ['x', 'suma_x_z'] ]

           x   suma_x_z
2   1.404860 -13.555543
4 -12.133476  -2.687964

In [42]:
df.iloc[ [2,3]]

           w          x          y         z   suma_x_z
3   5.524469 -22.324613 -10.773661 -0.039545 -22.364157
4 -16.956784 -12.133476  -6.642743  9.445512  -2.687964